cancankill/stm32-git/Hardware/Serial.c
#include "stm32f10x.h"                  // Device header
#include <stdio.h>
#include <stdarg.h>

char Serial_RxPacket[100];
uint8_t Serial_RxFlag;

void Serial_Init(void)
{
  RCC_APB2PeriphClockCmd(RCC_APB2Periph_USART1, ENABLE);
  RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOA, ENABLE);

  GPIO_InitTypeDef GPIO_InitStructure;
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF_PP;
  GPIO_InitStructure.GPIO_Pin = GPIO_Pin_9;
  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
  GPIO_Init(GPIOA, &GPIO_InitStructure);

  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IPU;
  GPIO_InitStructure.GPIO_Pin = GPIO_Pin_10;
  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
  GPIO_Init(GPIOA, &GPIO_InitStructure);

  USART_InitTypeDef USART_InitStruture;
  USART_InitStruture.USART_BaudRate = 9600;       // 波特率
  USART_InitStruture.USART_HardwareFlowControl = USART_HardwareFlowControl_None;  // 硬件流控制
  USART_InitStruture.USART_Mode = USART_Mode_Rx | USART_Mode_Tx;
  USART_InitStruture.USART_Parity = USART_Parity_No;   // 是否需要校验位
  USART_InitStruture.USART_StopBits = USART_StopBits_1; // 一位停止位
  USART_InitStruture.USART_WordLength = USART_WordLength_8b;  // 字长

  USART_ITConfig(USART1, USART_IT_RXNE, ENABLE);

  NVIC_PriorityGroupConfig(NVIC_PriorityGroup_2);  // 中断分组

  NVIC_InitTypeDef NVIC_InitStructure;
  NVIC_InitStructure.NVIC_IRQChannel = USART1_IRQn;  // 指定中断通道
  NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;     // 使能该通道
  NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 1;  // 抢占优先级
  NVIC_InitStructure.NVIC_IRQChannelSubPriority = 1;          // 响应优先级
  NVIC_Init(&NVIC_InitStructure);

  USART_Cmd(USART1, ENABLE);
}

void Serial_SendByte(uint8_t Byte)   // 发送一个字节
{
   USART_SendData(USART1, Byte);
   while(USART_GetITStatus(USART1, USART_FLAG_TXE) == RESET); // 等待发送完成
}

void Serial_SendArray(uint8_t *Array, uint16_t length)   // 发送一个数组
{
   uint16_t i;
   for(i = 0; i < length; i++)
   {
     Serial_SendByte(Array[i]);
   }
}

void Serial_SendString(char *String)
{
    uint8_t i;
    for(i = 0; String[i] != '\0'; i++)
    {
        Serial_SendByte(String[i]);
    }
}

int32_t Serial_Pow(uint32_t X, uint32_t Y)
{
    uint32_t Result = 1;
    while (Y--)
    {
        Result *= X;
    }
    return Result;
}

void Serial_SendNumber(uint32_t Number, uint8_t Length)
{
    uint8_t i;
    for (i = 0; i < Length; i++)
    {
        Serial_SendByte(Number / Serial_Pow(10, Length - i - 1) % 10 + '0');
    }
}

int fputc(int ch, FILE *f)
{
    Serial_SendByte(ch);
    return ch;
}

void Serial_Printf(char *format, ...)
{
    char String[100];
    va_list arg;
    va_start(arg, format);
    vsprintf(String, format, arg);
    va_end(arg);
    Serial_SendString(String);
}

void USART1_IRQHandler(void)
{
    static uint8_t RxState = 0;
    static uint8_t pRxPacket = 0;

    if(USART_GetITStatus(USART1, USART_IT_RXNE) == SET)   // 接收中断
    {
        uint8_t RxData = USART_ReceiveData(USART1);

        if(RxState == 0)  // 等待起始位 '@'
        {
            if(RxData == '@' && Serial_RxFlag == 0)
            {
                RxState = 1;
                pRxPacket = 0;
            }
        }
        else if(RxState == 1)  // 接收数据直到 '#'
        {
            if(RxData == '#')
            {
                RxState = 2;
            }
            else
            {
                Serial_RxPacket[pRxPacket] = RxData;
                pRxPacket++;
            }
        }
        else if(RxState == 2)  // 等待结束位 '*'
        {
            if(RxData == '*')
            {
                RxState = 0;
                Serial_RxPacket[pRxPacket] = '\0';
                Serial_RxFlag = 1;
            }
        }

        USART_ClearITPendingBit(USART1, USART_IT_RXNE);  // 清除中断标志位
    }
}
